app/controllers/boards_controller.rb

  def show
    @board = Board.last
    @picture = Picture.last
---
SELECT  "boards".* FROM "boards"   ORDER BY "boards"."id" DESC LIMIT 1
SELECT  "pictures".* FROM "pictures"   ORDER BY "pictures"."id" DESC LIMIT 1

  def new
    @board = Board.create
---
INSERT INTO "boards" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-11-23 02:34:48.176735"], ["updated_at", "2014-11-23 02:34:48.176735"]]