app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("created_at", "image", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-20 21:04:26.858432"], ["image", "pic.png"], ["updated_at", "2014-11-20 21:04:26.858432"]]
INSERT INTO "colors" ("created_at", "hex", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-23 02:34:47.168712"], ["hex", "#010101"], ["updated_at", "2014-11-23 02:34:47.168712"]]
---
  def create
    binding.pry
    @picture = Picture.create(picture_params)
    url = @picture.image_url
    # url = Rails.root + "tmp/#{@picture.id}/#{@picture.image.filename}"
    @picture.parse_colors(url)

    @board = Board.new
    @picture.board = @board
    @picture.save